{
  "adaptive_patching_levels": 0,
  "architectures": [
    "TinyTimeMixerForPrediction"
  ],
  "categorical_vocab_size_list": null,
  "context_length": 512,
  "d_model": 192,
  "decoder_adaptive_patching_levels": 0,
  "decoder_d_model": 192,
  "decoder_mode": "common_channel",
  "decoder_num_layers": 3,
  "decoder_raw_residual": false,
  "disable_pad_activations": true,
  "distribution_output": "student_t",
  "dropout": 0.7,
  "enable_forecast_channel_mixing": false,
  "enable_fourier_attention": 0,
  "exogenous_channel_indices": null,
  "expansion_factor": 2,
  "fcm_context_length": 1,
  "fcm_gated_attn": true,
  "fcm_mix_layers": 2,
  "fcm_prepend_past": true,
  "fcm_prepend_past_offset": null,
  "fcm_use_mixer": false,
  "fft_length": 0,
  "frequency_token_vocab_size": 5,
  "gated_attn": true,
  "head_dropout": 0.7,
  "huber_delta": 1,
  "init_embed": "pytorch",
  "init_linear": "pytorch",
  "init_processing": true,
  "init_std": 0.02,
  "loss": "mse",
  "loss_scales": null,
  "mask_value": 0,
  "masked_context_length": null,
  "mode": "common_channel",
  "model_type": "tinytimemixer",
  "multi_scale": false,
  "multi_scale_loss": false,
  "norm_eps": 1e-05,
  "norm_mlp": "LayerNorm",
  "num_input_channels": 1,
  "num_input_examples": 5,
  "num_kernels": 3,
  "num_layers": 5,
  "num_parallel_samples": 100,
  "num_patches": 69,
  "patch_gating": false,
  "patch_last": true,
  "patch_length": 8,
  "patch_stride": 8,
  "positional_encoding_type": "sincos",
  "post_init": false,
  "prediction_channel_indices": null,
  "prediction_filter_length": null,
  "prediction_length": 48,
  "quantile": 0.5,
  "register_tokens": 5,
  "resolution_prefix_tuning": false,
  "scaling": "revin",
  "self_attn": false,
  "self_attn_heads": 1,
  "torch_dtype": "float32",
  "transformers_version": "4.53.0",
  "trend_d_model": 16,
  "trend_decoder_d_model": 8,
  "trend_decoder_num_layers": 3,
  "trend_num_layers": 3,
  "trend_patch_length": 8,
  "trend_patch_stride": 8,
  "use_decoder": true,
  "use_fft_embedding": false,
  "use_positional_encoding": false
}
